---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DesignOptionConflictError
source: html/8b12e569-c0d5-fc14-3539-41833c360c85.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DesignOptionConflictError Property

The solution is failing to do the elements are not in the same Design Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId DesignOptionConflictError { get; }
```